docs/angular.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-13 Mon 09:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Angular</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="b-coimbra" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Angular</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org520a957">1. Usage</a></li>
<li><a href="#org8fc0739">2. Shell commands</a></li>
<li><a href="#org935351e">3. Modules</a></li>
<li><a href="#org96fca56">4. Components</a></li>
<li><a href="#orgc2af495">5. Services</a>
<ul>
<li><a href="#org4ece201">5.1. @Injectable()</a></li>
</ul>
</li>
<li><a href="#orgfdac73f">6. Miscs</a>
<ul>
<li><a href="#orgd69d9b9">6.1. ngOnInit()</a></li>
<li><a href="#org8741f01">6.2. [(ngModel)]="hero.name"</a></li>
<li><a href="#orgeb02222">6.3. *ngFor</a></li>
<li><a href="#orgaf90866">6.4. (click)="event(movie)"</a></li>
<li><a href="#org95c1d92">6.5. *ngIf="property"</a></li>
<li><a href="#org25c5304">6.6. [class.selected]="condition"</a></li>
<li><a href="#org41fc601">6.7. @Input() decorator</a></li>
<li><a href="#org7069f61">6.8. Observables</a></li>
<li><a href="#orga148ff5">6.9. Subscriber function</a></li>
</ul>
</li>
<li><a href="#org9a4c4ea">7. Routing</a></li>
<li><a href="#org991a6b8">8. Http</a></li>
</ul>
</div>
</div>

<div id="outline-container-org520a957" class="outline-2">
<h2 id="org520a957"><span class="section-number-2">1</span> Usage</h2>
<div class="outline-text-2" id="text-1">
<p>
Angular is a platform for building applications with the web (mobile too) using declarative templates.
</p>
</div>
</div>

<div id="outline-container-org8fc0739" class="outline-2">
<h2 id="org8fc0739"><span class="section-number-2">2</span> Shell commands</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>ng new &lt;name&gt;</code></td>
<td class="org-left">Creates a new angular project</td>
</tr>

<tr>
<td class="org-left"><code>ng serve --open</code></td>
<td class="org-left">builds the app, starts the server, watches the src files at port <b>4200</b></td>
</tr>

<tr>
<td class="org-left"><code>ng generate component &lt;name&gt;</code></td>
<td class="org-left">Generates a new component</td>
</tr>

<tr>
<td class="org-left"><code>ng generate service &lt;name&gt;</code></td>
<td class="org-left">Creates a new service.</td>
</tr>

<tr>
<td class="org-left"><code>ng generate module &lt;app-routing&gt; --flat --module=app</code></td>
<td class="org-left">creates a new rout</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org935351e" class="outline-2">
<h2 id="org935351e"><span class="section-number-2">3</span> Modules</h2>
<div class="outline-text-2" id="text-3">
<p>
A module is a collection of services, it's the building block of an application.
Each application has at least one root module, and it's by default defined in the <code>app.module.ts</code>
</p>

<p>
<b>Modules can have multiple components and services</b>
</p>
</div>
</div>

<div id="outline-container-org96fca56" class="outline-2">
<h2 id="org96fca56"><span class="section-number-2">4</span> Components</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>ng generate component</code>
</p>

<p>
Components are responsible for displaying data on the screen, listening for user input and taking action based on that input.
It defines a part of your application.
</p>

<p>
A component consists of a view and a class where the view defines the look of the component (HTML), and the class defines the behaviour (TypeScript)
</p>

<ul class="org-ul">
<li><p>
The component defined in the router are loaded in to a special placeholder:
</p>

<div class="org-src-container">
<pre class="src src-web">&lt;router-outlet&gt;&lt;/router-outlet&gt;
</pre>
</div></li>
</ul>

<p>
<b>Every app has at least one component (the root component), generally the <code>app.component.</code> files</b>
</p>
</div>
</div>

<div id="outline-container-orgc2af495" class="outline-2">
<h2 id="orgc2af495"><span class="section-number-2">5</span> Services</h2>
<div class="outline-text-2" id="text-5">
<p>
Services are a great way to share information among classes that don't know each other.
</p>

<p>
They objects that are wired together using dependency injection,
they allow easy reuse of parts of the application logic across multiple applications.
</p>

<p>
<b>Normally the components are not supposed to be in charge of fetching the data and saving the data, only for connection the presentation layer.</b>
</p>
</div>

<div id="outline-container-org4ece201" class="outline-3">
<h3 id="org4ece201"><span class="section-number-3">5.1</span> @Injectable()</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This marks the class as one that participates int he dependency injection system.
It accepts a metadata object for the service, the same way the <code>@Component</code> decorator did.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfdac73f" class="outline-2">
<h2 id="orgfdac73f"><span class="section-number-2">6</span> Miscs</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgd69d9b9" class="outline-3">
<h3 id="orgd69d9b9"><span class="section-number-3">6.1</span> ngOnInit()</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Different than a constructor, it's a cycle hook called by Angular to indicate that it's done creating the component.
It's a good place to put initialization logic.
</p>

<p>
<b>It gets called on the first data change</b>
</p>
</div>
</div>

<div id="outline-container-org8741f01" class="outline-3">
<h3 id="org8741f01"><span class="section-number-3">6.2</span> [(ngModel)]="hero.name"</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<b>Not available by default, we need to import the FormsModule module</b>
</p>
<div class="org-src-container">
<pre class="src src-typescript">imports: [
    FormsModule
],
</pre>
</div>

<p>
Two-way data binding syntax, it binds the property to the HTML textbox so that data can flow in both directions: from the hero.name property to the checkbox, and from the textbos back to the hero.name.
</p>
</div>
</div>

<div id="outline-container-orgeb02222" class="outline-3">
<h3 id="orgeb02222"><span class="section-number-3">6.3</span> *ngFor</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<code>*ngFor</code> is a repeater directive, it repeats the host element for each element in a list.
</p>
</div>
</div>

<div id="outline-container-orgaf90866" class="outline-3">
<h3 id="orgaf90866"><span class="section-number-3">6.4</span> (click)="event(movie)"</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Listens for a click event.
</p>
</div>
</div>

<div id="outline-container-org95c1d92" class="outline-3">
<h3 id="org95c1d92"><span class="section-number-3">6.5</span> *ngIf="property"</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<code>*ngIf</code> hides empty details.
</p>
</div>
</div>

<div id="outline-container-org25c5304" class="outline-3">
<h3 id="org25c5304"><span class="section-number-3">6.6</span> [class.selected]="condition"</h3>
<div class="outline-text-3" id="text-6-6">
<p>
<code>[class.selected]</code> is an angular binding that makes it easy to add a CSS class.
Just type <code>[class.some-css-class]="some-condition"</code> to the elemtn you want to style.
</p>
</div>
</div>


<div id="outline-container-org41fc601" class="outline-3">
<h3 id="org41fc601"><span class="section-number-3">6.7</span> @Input() decorator</h3>
<div class="outline-text-3" id="text-6-7">
<p>
To bind an external component such as:
</p>

<div class="org-src-container">
<pre class="src src-typescript">&lt;app-hero-detail [hero]=<span style="color: #87875f;">"selectedHero"</span>&gt;&lt;/app-hero-detail&gt;
</pre>
</div>

<p>
It's necessary to bind the property to the @Input decorator like so:
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #faf4c6;">@Input</span>() hero: <span style="color: #8181a6;">Hero</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7069f61" class="outline-3">
<h3 id="org7069f61"><span class="section-number-3">6.8</span> Observables</h3>
<div class="outline-text-3" id="text-6-8">
<p>
An Observable allows to pass zero or more events where the callback is called for each event.
</p>

<p>
<b>It's basically a Promise with more features</b>
</p>

<p>
Observable has the advantage over Promise to be <b>cancelable</b>, it provides all the operators a Promise uses,
and others like <code>retry()</code> and <code>replay()</code> that are quite handy.
</p>
</div>

<div id="outline-container-orga148ff5" class="outline-3">
<h3 id="orga148ff5"><span class="section-number-3">6.9</span> Subscriber function</h3>
<div class="outline-text-3" id="text-6-9">
<p>
We define a subscribe function &#x2013; it's executed when the customer calls the <code>subscriber()</code> method.
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #87AFD7; font-weight: bold;">const</span> <span style="color: #faf4c6;">locations</span> = <span style="color: #87AFD7; font-weight: bold;">new</span> <span style="color: #8181a6;">Observable</span>(observer <span style="color: #87AFD7; font-weight: bold;">=&gt;</span> {
    <span style="color: #686858;">// </span><span style="color: #686858;">get the next error callbacks.</span>
    <span style="color: #87AFD7; font-weight: bold;">const</span> { next, error } = observer;
    <span style="color: #87AFD7; font-weight: bold;">let</span> <span style="color: #faf4c6;">watchId</span>;

    <span style="color: #686858;">// </span><span style="color: #686858;">geolocation API</span>
    <span style="color: #87AFD7; font-weight: bold;">if</span> (<span style="color: #87875f;">'geolocation'</span> <span style="color: #87AFD7; font-weight: bold;">in</span> navigator)
        watchId = navigator.geolocation.<span style="color: #faf4c6;">watchPosition</span>(next, error);
    <span style="color: #87AFD7; font-weight: bold;">else</span>
        <span style="color: #faf4c6;">error</span>(<span style="color: #87875f;">'Geolocation not available'</span>);

    <span style="color: #686858;">// </span><span style="color: #686858;">clean up data when unsubscribe() is called</span>
    <span style="color: #87AFD7; font-weight: bold;">return</span> { <span style="color: #faf4c6;">unsubscribe</span>() { navigator.geolocation.<span style="color: #faf4c6;">clearWatch</span>(watchId) } };
});
</pre>
</div>

<p>
Call <code>subscribe()</code> and starts listening for updates. It's the equivalent of the <code>then</code> operator.
</p>

<div class="org-src-container">
<pre class="src src-typescript">
<span style="color: #87AFD7; font-weight: bold;">const</span> <span style="color: #faf4c6;">locationSubscription</span> = locations.<span style="color: #faf4c6;">subscribe</span>({
    <span style="color: #faf4c6;">next</span>(position) { <span style="color: #8181a6;">console</span>.<span style="color: #faf4c6;">log</span>(position); }
    <span style="color: #faf4c6;">error</span>(msg) { <span style="color: #8181a6;">console</span>.<span style="color: #faf4c6;">log</span>(msg); }
});

<span style="color: #686858;">// </span><span style="color: #686858;">stop listening for location after 10 seconds</span>

<span style="color: #faf4c6;">setTimeout</span>(() <span style="color: #87AFD7; font-weight: bold;">=&gt;</span> locationSubscription.<span style="color: #faf4c6;">unsubscribe</span>(), 1000);
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org9a4c4ea" class="outline-2">
<h2 id="org9a4c4ea"><span class="section-number-2">7</span> Routing</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>ng generate module &lt;name&gt; --flat --module=&lt;name&gt;</code>
</p>

<ol class="org-ol">
<li>path: string that matches the URL in the browser address bar.</li>
<li>component: the component that the router should create when navigation to this route.</li>
</ol>

<p>
<code>routerLink="/path/"</code> denotes a router path, .eg:
</p>

<div class="org-src-container">
<pre class="src src-web">&lt;a routerLink="/detail/{{hero.id}}"&gt;{{hero.name}}&lt;/a&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org991a6b8" class="outline-2">
<h2 id="org991a6b8"><span class="section-number-2">8</span> Http</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #87AFD7; font-weight: bold;">import</span> { HttlClientModule } <span style="color: #87AFD7; font-weight: bold;">from</span> <span style="color: #87875f;">'@angular/common/http'</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-09-11 Sat 00:00</p>
<p class="author">Author: b-coimbra</p>
<p class="date">Created: 2021-09-13 Mon 09:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
